---
kind: type
id: T:Autodesk.Revit.DB.StripedRowPattern
source: html/9b50cb0d-d42a-e8b0-9243-73f214c1c21d.htm
---
# Autodesk.Revit.DB.StripedRowPattern

An enumerated type representing the possible sets of rows of a striped row schedule.

## Syntax (C#)
```csharp
public enum StripedRowPattern
```